Repository: Anuroopa-123/HLC_Frontend
Catalog: src/locale/messages.*.xlf
Languages: ta

source: high-level committee
ta: ஒன்றிய-மாநில உறவுகள்

source: on
ta: குறித்த

source: union-state relations
ta: உயர்நிலைக் குழு

source: Justice Kurian Joseph (Retd.)
ta: நீதியரசர் குரியன் ஜோசப் (ஓய்வு),

source: Chairman
ta: தலைவர்

source: Profile
ta: பணிவிளக்கக் குறிப்பு

source: Thiru K. Ashok Vardhan Shetty IAS (Retd.)
ta: திரு. கே. அசோக் வரதன் ஷெட்டி, இ.ஆ.ப., (ஓய்வு)

source: Member - 1
ta: உறுப்பினர்-1

source: Dr. M. Naganathan
ta: டாக்டர் மு.நாகநாதன்

source: Member - 2
ta: உறுப்பினர்-2

source: Doyens
ta: மாநிலத்

source: of
ta: தன்னாட்சியின்

source: State Autonomy
ta: மதிப்புக்குரிய முன்னோடிகள்

source: Dr. C. N. Annadurai
ta: டாக்டர் சி. என்.அண்ணாதுரை

source: Former Chief Minister of Tamil Nadu
ta: முன்னாள் முதலமைச்சர், தமிழ்நாடு

source: Views on Union-State Relations
ta: ஒன்றிய-மாநில உறவுகள் குறித்த கருத்துகள்

source: Dr. M. Karunanidhi
ta: டாக்டர் மு.கருணாநிதி

source: Thiru M. K. Stalin
ta: திரு. மு. .க ஸ்டாலின்

source: Hon'ble Chief Minister of Tamil Nadu
ta: மாண்புமிகு முதலமைச்சர், தமிழ்நாடு

source: Watch Video
ta: காணொளிக் காண்க

source: On April 15, 2025, Thiru M.K. Stalin, Hon’ble Chief Minister of Tamil Nadu, announced in the Legislative Assembly the constitution of a three-member High-Level Committee on Union-State Relations
ta: ஏப்ரல் 15, 2025 அன்று, மாண்புமிகு தமிழ்நாடு முதலமைச்சர் திரு.மு.க.ஸ்டாலின் அவர்கள் மூவரை உறுப்பினர்களாகக் கொண்ட ஒன்றிய-மாநில உறவுகள் குறித்த உயர்நிலைக் குழு அமைக்கப்படும் எனச் சட்டமன்றத்தில் அறிவித்தார்

source: Home
ta: முகப்பு

source: About the Committee
ta: குழுவைப் பற்றி

source: Previous Commissions
ta: முந்தைய ஆணையங்கள்

source: Reference Materials
ta: ஆய்வுக் குறிப்புகள்

source: Gallery
ta: காட்சியகம்

source: Contact
ta: தொடர்பு

source: View Questionnaire
ta: வினாப் பட்டியல் காண்க

source: Submit Your Responses
ta: தங்களின் கருத்துகளை அளிக்கவும்

source: Visitor Count
ta: பார்வையாளர் எண்ணிக்கை

source: Last Updated : Aug 2, 2025
ta: கடைசியாக புதுப்பிக்கப்பட்ட நாள் : ஆகஸ்ட் 2, 2025

source: Content owned and maintained by High-Level Committee on Union-State Relations
ta: இணையத்தள உரிமை மற்றும் பராமரிப்பு: ஒன்றிய-மாநில உறவுகள் குறித்த உயர்-நிலைக் குழு

source: Queries/Comments regarding the content on this site may be sent to <a href="mailto:secretary[dot]hlc[dot]usr[at]tn[dot]gov[dot]in">secretary[dot]hlc[dot]usr[at]tn[dot]gov[dot]in</a>
ta: இந்தத் தளத்தில் உள்ள உள்ளடக்கம் தொடர்பான கேள்விகள்/கருத்துகளைப் பகிர

source: Disclaimer
ta: பொறுப்பு துறப்பு

source: Privacy and Copyright Policy
ta: தனியுரிமை மற்றும் பதிப்புரிமைக் கொள்கை

source: Terms of Use
ta: பயன்பாட்டு விதிமுறைகள்

source: Copyright@2025
ta: பதிப்புரிமை@2025

source: Previous Commissions <span class="lowercase">on</span> Union-State Relations
ta: ஒன்றிய-மாநில உறவுகள் குறித்த முந்தைய ஆணையங்கள்

source: Rajamannar Committee Report Cover
ta: இராஜமன்னார் குழு அறிக்கையின் கவர்

source: Rajamannar Committee (1969-1971)
ta: இராஜமன்னார்க் குழு (1969-1971)

source: constituted by the Government of Tamil Nadu
ta: தமிழ் நாடு அரசால் அமைக்கப்பட்டது

source: Chairman:
ta: தலைவர் :

source: Dr. P. V. Rajamannar,
ta: டாக்டர் பி.வி. இராஜமன்னார்

source: Former Chief Justice of the High Court of Madras
ta: முன்னாள் தலைமை நீதியரசர், சென்னை உயர் நீதிமன்றம்

source: Member :
ta: உறுப்பினர் :

source: Dr. A. Lakshmanaswami Mudaliar,
ta: டாக்டர் ஆ. இலட்சுமணசாமி முதலியார்

source: Former Vice-Chancellor of the University of Madras
ta: முன்னாள் துணை வேந்தர், சென்னைப் பல்கலைக் கழகம்

source: Thiru P. Chandra Reddy,
ta: திரு பி. சந்திரா ரெட்டி

source: View Report
ta: அறிக்கை காண்க

source: Sarkaria Commission Report Cover
ta: சர்க்காரியா ஆணையம் அறிக்கை முகப்பு

source: Sarkaria Commission (1983-1988)
ta: சர்க்காரியா ஆணையம் (1983-1988)

source: constituted by the Government of India
ta: ஒன்றிய அரசால் அமைக்கப்பட்டது

source: Justice R. S. Sarkaria,
ta: நீதியரசர் ஆர்.எஸ். சர்க்காரியா

source: Former Judge of the Supreme Court of India
ta: முன்னாள் நீதியரசர், இந்திய உச்ச நீதிமன்றம்

source: Thiru. B. Sivaraman, ICS(Retd.)
ta: திரு பி. சிவராமன், ஐசிஎஸ் (ஓய்வு)

source: Former Cabinet Secretary of India
ta: முன்னாள் ஒன்றிய அமைச்சரவை செயலாளர்

source: Dr. S. R. Sen
ta: டாக்டர் எஸ்.ஆர். சென்

source: Former Executive Director, International Bank for <br> Reconstruction and Development
ta: முன்னாள் நிருவாக இயக்குநர், பன்னாட்டு மறுசீரமைப்பு மற்றும் வளர்ச்சி வங்கி

source: Punchhi Commission (2007-2010)
ta: புஞ்சி ஆணையம் (2007-2010)

source: Justice Madan Mohan Punchhi,
ta: நீதியரசர் மதன் மோகன் புஞ்சி

source: Former Chief Justice of India
ta: உச்ச நீதிமன்ற முன்னாள் தலைமை நீதிபதி

source: Thiru Dhirendra Singh, IAS, (Retd.)
ta: திரு திரேந்திர சிங், இஆப (ஓய்வு)

source: Thiru Vinod Kumar Duggal, IAS, (Retd.)
ta: திரு வினோத் குமார் டக்கல், இஆப (ஓய்வு)

source: Dr. N.R. Madhava Menon,
ta: டாக்டர் என்.ஆர். மாதவ மேனன்

source: Former Director, National Law School of India University, <br>Bengaluru and <br>Former Director, National Judicial Academy, Bhopal
ta: முன்னாள் இயக்குநர், சட்டத் தேசியப் பல்கலைக்கழகம், பெங்களுரு மற்றும் முன்னாள் இயக்குநர், தேசிய நீதியியல் கல்வி மையம், போபால்

source: Member - :
ta: உறுப்பினர் -:

source: Secretary
ta: செயலர்

source: Thiru Vijay Shanker, IPS (Retd.)
ta: திரு விஜய் சங்கர், இகாப (ஓய்வு)

source: Former Director of CBI
ta: முன்னாள் இயக்குநர், ஒன்றியப் புலனாய்வுக் குழு

source: Member - 1
ta: உறுப்பினர்-1

source: Constitution of India
ta: இந்திய அரசமைப்புச் சட்டம்

source: View
ta: காண்க

source: Constituent Assembly Debates
ta: அரசமைப்புச் சட்ட அவை விவாதங்கள்

source: Reports of the Finance Commission of India
ta: இந்திய நிதிக் குழு ஆணையத்தின் அறிக்கை

source: World Constitutions
ta: உலக அரசமைப்பு சட்டங்கள்

source: Forum of Federations
ta: கூட்டாட்சி நாடுகளுக்கான மன்றம்

source: Memoranda of Government of Tamil Nadu to the Finance Commissions of India
ta: இந்திய நிதி ஆணையங்களுக்குத் தமிழ் நாடு அரசின் சார்பாகக் கொடுக்கப்பட்ட கோரிக்கை ஆவணங்கள்

source: Contact Details
ta: தொடர்பு விவரங்கள்

source: Dr. R. Srinivasan,
ta: டாக்டர் இராம. சீனிவாசன்,

source: Secretary and Research Officer,
ta: செயலாளர் மற்றும் ஆராய்ச்சி அலுவலர்,

source: High-Level Committee on Union-State Relations,
ta: ஒன்றிய-மாநில உறவுகளுக்கான உயர் நிலைக் குழு,

source: Old State Guest House,
ta: பழைய மாநில விருந்தினர் மாளிகை,

source: Walajah Road,
ta: வாலாஜா சாலை,

source: Chepauk, Chennai-600 005.
ta: சேப்பாக்கம், சென்னை-600 005.

source: Email Id:
ta: மின்னஞ்சல் முகவரி:
